---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementClassFilter
source: html/e19b753f-8d74-0a9c-b8aa-65809418ff97.htm
---
# ElementClassFilter Members

Constructs a new instance of a filter to match elements by class.